config/emacs.org
*** C/C++
#+begin_src elisp :tangle ~/config/emacs/themes/battery.el
(compilation-error          (:inherit 'error))
(compilation-warning        (:inherit 'warning))
(compilation-info           (:inherit 'success))
(compilation-mode-line-fail (:weight 'bold :foreground red :inherit 'compilation-error))
(compilation-mode-line-run  (:inherit 'compilation-warning))
(compilation-mode-line-exit (:weight 'bold :foreground green :inherit 'compilation-info))
(compilation-line-number    (:inherit 'font-lock-keyword-face))
(compilation-column-number  (:inherit 'font-lock-doc-face))
(c-nonbreakable-space-face (:background dark-red))
#+end_src

#+begin_src elisp
(use-package cc-mode
  :elpaca nil
  :requires eglot
  :hook ((c-mode c++-mode) . eglot-ensure)
  :custom (c-label-minimum-indentation 0)
  :config
  (when (not (locate-file "clangd" exec-path))
    (warn "`clangd' not in `exec-path'. Emacs won't be able to connect to C/C++ LSP server."))
  (add-to-list 'eglot-server-programs
               (cons '(c-mode c++-mode)
                     (lambda ()
                       (list
                        "clangd"
                        "--enable-config"
                        (concat "--compile-commands-dir="
                                (f-join
                                 (project-root (project-current t))
                                 "build/")))))))

;; C/C++
(setq compile-command "make"
      compilation-scroll-output t)

(use-package cmake-mode)

(defun yeet/cmake-prepare (is-release)
  (interactive
   (list (yes-or-no-p "Set build type to Release (otherwise Debug)? ")))
  (let ((default-directory (project-root (project-current t)))
        (compile-command
         (s-join " "
                 (list "cmake" "-S" "." "-B" "build" "-Wdeprecated" "-D" (concat "CMAKE_BUILD_TYPE=" (if is-release "Release" "Debug")) "-D" "CMAKE_EXPORT_COMPILE_COMMANDS=1"))))
    (call-interactively 'compile)))

(defun yeet/cmake-build ()
  (interactive)
  (let ((default-directory (project-root (project-current t)))
        (compile-command "cmake --build build"))
    (call-interactively 'compile)))

(use-package clang-format
  :hook ((c-mode c++-mode) . (lambda () (add-hook 'before-save-hook 'clang-format-buffer nil t)))
  :config
  (setq clang-format-style "file"
        ;; if no `.clang-format' is found, don't do anything
        clang-format-fallback-style "none"))

;; debugger
(use-package realgud
  :bind ("C-c d" . realgud:gdb))
#+end_src

#+begin_src elisp :tangle ~/config/emacs/themes/battery.el
(realgud-debugger-running      (:weight 'bold :foreground high-green))
(realgud-debugger-not-running  (:inherit 'font-lock-warning-face))
(realgud-overlay-arrow1        (:inherit 'realgud-debugger-running))
(realgud-overlay-arrow2        (:weight 'bold :foreground grey15))
(realgud-overlay-arrow3        (:foreground grey6))
(realgud-bp-enabled-face       (:weight 'bold :foreground high-red))
(realgud-bp-line-enabled-face  (:box (:color high-red)))
(realgud-bp-disabled-face      (:weight 'bold :foreground grey10))
(realgud-bp-line-disabled-face (:box (:color grey10)))
(realgud-line-numbers          (:inherit 'font-lock-variable-name-face))
(realgud-file-name             (:inherit 'font-lock-preprocessor-face))
(realgud-backtrace-number      (:weight 'bold :foreground bg))
#+end_src

#+begin_src elisp
;; disassembler
(use-package rmsbolt
  :commands rmsbolt)

(use-package yasnippet-snippets)
(use-package yasnippet
  :after yasnippet-snippets
  :hook ((c-mode c++-mode) . yas-minor-mode)
  :config (yas-reload-all))
#+end_src

*** J
On Void Linux this is pretty finnicky since the default name of the console executable is =jc= due to conflicts with other packages.

#+begin_src elisp
(use-package j-mode
  :config (setq j-console-cmd "jconsole"))

(use-package ob-J
  :elpaca nil ;; comes from `'org-contrib'
  :after (ob org-contrib j-mode)
  :custom (org-babel-J-command "jconsole")
  :config (add-to-list 'org-babel-load-languages '(J . t)))
#+end_src

#+begin_src elisp :tangle ~/config/emacs/themes/battery.el
(j-verb-face        (:inherit 'font-lock-builtin-face))
(j-adverb-face      (:inherit 'font-lock-builtin-face))
(j-conjunction-face (:inherit 'font-lock-builtin-face))
(j-other-face       (:inherit 'default))
#+end_src

*** Zig
Zig always indents by 4 spaces. Use =zls= as the language server.

#+begin_src elisp
(use-package zig-mode
  :hook (zig-mode . eglot-ensure)
  :commands zig-mode
  :custom
  (zig-indent-offset 4)
  (zig-format-on-save nil))
#+end_src

*** Lua

#+begin_src elisp :noweb yes
(use-package lua-mode
  :commands lua-mode
  :requires f eglot
  :config
  (setq lua-indent-level 2)
  (add-to-list 'eglot-server-programs
               (cons 'lua-mode
                     (eglot-alternatives
                      (list
                       (list "lua-language-server" "--config-path" (f-join (xdg-config-home) "lua-language-server" "config.lua"))
                       "lua-lsp"))))
  <<disable-formatter>>)
#+end_src

**** TODO fix very annoying formatter
For now, I just disable the =onTypeFormatting= LSP message altogether.

#+name: disable-formatter
#+begin_src elisp :tangle nil
(add-to-list 'eglot-ignored-server-capabilities :documentOnTypeFormattingProvider)
#+end_src

*** Python
When using python on [[id:2929ef7d-0e55-4c9e-8f08-b120d9997f10][Org Mode]] src blocks, import sympy and numpy by default.

#+begin_src elisp
(use-package python
  :elpaca nil
  :config (setq python-indent-offset 2))

(use-package ob-python
  :elpaca nil
  :after (ob org-contrib python)
  :custom
  (org-babel-default-header-args:python
   '((:session  . "none")
     (:results  . "output")
     (:exports  . "code")
     (:cache    . "no")
     (:noweb    . "no")
     (:hlines   . "no")
     (:tangle   . "no")
     (:prologue . "import sympy as sp, numpy as np")))
  :config (add-to-list 'org-babel-load-languages '(python . t)))

(use-package auto-virtualenv
  :after python
  :hook (python-mode . auto-virtualenv-set-virtualenv))
#+end_src

*** Markdown

#+begin_src elisp
(use-package markdown-mode
  :commands markdown-mode
  :mode ("README\\.md\\'" . gfm-mode)
  :init (setq markdown-command "multimarkdown"))
#+end_src

#+begin_src elisp :tangle ~/config/emacs/themes/battery.el
(markdown-header-face-6 (:height 1.0 :inherit 'markdown-header-face))
(markdown-header-face-5 (:height 1.0 :inherit 'markdown-header-face))
(markdown-header-face-4 (:height 1.0 :inherit 'markdown-header-face))
(markdown-header-face-3 (:height 1.0 :inherit 'markdown-header-face))
(markdown-header-face-2 (:height 1.0 :inherit 'markdown-header-face))
(markdown-header-face-1 (:height 1.0 :inherit 'markdown-header-face))
(markdown-header-face (:weight 'bold :inherit ('font-lock-function-name-face)))

(markdown-highlighting-face (:foreground neutral0 :background lighter-olive))

(markdown-html-entity-face        (:inherit 'font-lock-variable-name-face))
(markdown-html-attr-value-face    (:inherit 'font-lock-string-face))
(markdown-html-attr-name-face     (:inherit 'font-lock-variable-name-face))
(markdown-html-tag-delimiter-face (:inherit 'markdown-markup-face))
(markdown-html-tag-name-face      (:inherit 'font-lock-type-face))

(markdown-hr-face (:inherit 'markdown-markup-face))
(markdown-highlight-face (:inherit 'highlight))
(markdown-gfm-checkbox-face (:inherit 'font-lock-builtin-face))
(markdown-metadata-value-face (:inherit 'font-lock-string-face))
(markdown-metadata-key-face (:inherit 'font-lock-variable-name-face))
(markdown-math-face (:inherit 'font-lock-string-face))
(markdown-comment-face (:inherit 'font-lock-comment-face))
(markdown-line-break-face (:underline t :inherit 'font-lock-constant-face))
(markdown-link-title-face (:inherit 'font-lock-comment-face))
(markdown-plain-url-face (:inherit 'markdown-link-face))
(markdown-url-face (:inherit 'font-lock-string-face))
(markdown-footnote-text-face (:inherit 'font-lock-comment-face))
(markdown-footnote-marker-face (:inherit 'markdown-markup-face))
(markdown-reference-face (:inherit 'markdown-markup-face))
(markdown-missing-link-face (:inherit 'font-lock-warning-face))
(markdown-link-face (:inherit 'link))
(markdown-language-info-face (:inherit 'font-lock-string-face))
(markdown-language-keyword-face (:inherit 'font-lock-type-face))
(markdown-table-face (:inherit ('markdown-code-face)))
(markdown-pre-face (:inherit ('markdown-code-face 'font-lock-constant-face)))
(markdown-inline-code-face (:inherit ('markdown-code-face 'font-lock-constant-face)))
(markdown-code-face (:inherit 'fixed-pitch))
(markdown-blockquote-face (:inherit 'font-lock-doc-face))
(markdown-list-face (:inherit 'markdown-markup-face))
(markdown-header-delimiter-face (:inherit 'markdown-markup-face))
(markdown-header-rule-face (:inherit 'markdown-markup-face))
(markdown-markup-face (:weight 'normal :slant 'normal :inherit 'shadow))
(markdown-strike-through-face (:strike-through t))
(markdown-bold-face (:inherit 'bold))
(markdown-italic-face (:inherit 'italic))
#+end_src

*** OCaml

#+begin_src elisp
(use-package tuareg-mode
  :elpaca (tuareg-mode
           :type git
           :host github
           :repo "ocaml/tuareg")
  :commands tuareg-mode)
#+end_src

#+begin_src elisp :tangle ~/config/emacs/themes/battery.el
(tuareg-font-lock-interactive-directive-face (:foreground high-cyan))
(tuareg-font-lock-operator-face              (:foreground grey11))
(tuareg-font-lock-governing-face             (:foreground high-red))
(tuareg-font-double-semicolon-face           (:foreground high-red))
(tuareg-font-lock-module-face                (:foreground high-yellow))
#+end_src

*** &rest
#+begin_src elisp
(use-package     bnf-mode :commands bnf-mode)
(use-package     csv-mode :commands csv-mode)
(use-package haskell-mode :commands haskell-mode)
(use-package    yaml-mode :commands yaml-mode)

(use-package web-mode
  :hook
  (web-mode . (lambda ()
                (add-to-list 'electric-pair-pairs '(?\< . ?\>))))
  :commands web-mode)

(use-package js
  :elpaca nil
  :config (setq js-indent-level 2))

(use-package julia-mode
  :commands julia-mode
  :custom (julia-indent-offset 2)
  :config (add-to-list 'org-babel-load-languages '(julia . t)))

(use-package nix-mode
  :mode "\\.nix\\'"
  :commands nix-mode)

(use-package nushell-mode
  :disabled
  :elpaca (nushell-mode
             :type git
             :host github
             :repo "mrkkrp/emacs-nushell")
  :mode "\\.nu\\'"
  :commands nushell-mode
  :config
  (setq nushell-indent-offset 2))

(use-package nushell-ts-mode
  :elpaca (nushell-ts-mode
           :type git
           :host github
           :repo "herbertjones/nushell-ts-mode")
  :after org
  :config
  ; (require 'nushell-ts-babel)
  (add-to-list 'org-babel-load-languages '(nushell-ts . t)))

(use-package prolog
  :elpaca nil
  :commands prolog-mode
  :mode ("\\.pl\\'" . prolog-mode))

(use-package rust-mode
  :commands rust-mode
  :config (setq rust-indent-offset 2))

(use-package rustic
  :disabled
  :after rust-mode
  :config (setq rustic-lsp-client nil))
#+end_src

** clipboard
Use the X11 clipboard as the default for things like yanking, killing and pasting.

#+begin_src elisp
(setq-default x-select-enable-clipboard t
              x-select-enable-primary nil)
#+end_src

** pop-ups
Wether or not popups should create new frames instead of splitting windows. May not work with all modes. This is good when using a tiling window manager.

#+begin_src elisp
(setq-default pop-up-frames nil
              pop-up-windows t)
#+end_src

** TODO bell
Variable src_elisp{`visible-bell'} doesn't seem to have any effect. Maybe my theme does not respond well? Will have to test this with Adwaita. The src_elisp{`ring-bell'} function flashes the mode-line in inverted colors.

This is triggered by events such as trying to src_elisp{`delete-backward-char'} on empty modeline buffer.

#+begin_src elisp
(setq visible-bell nil
      ring-bell-function
      #'(lambda ()
          (invert-face 'mode-line)
          (run-with-timer 0.1 nil #'invert-face 'mode-line)))
#+end_src

** apropos
#+begin_src elisp
(setq-default apropos-do-all t)
#+end_src

** disable startup message
Stop Emacs' default startup message from appearing in the src_elisp{`*Messages'} buffer.

#+begin_src elisp
(unless (daemonp)
  (advice-add #'display-startup-echo-area-message :override #'ignore))
#+end_src

** external programs
Open some file types using external programs.

#+begin_src elisp
(use-package openwith
  :custom
  (openwith-associations
   `((,(rx ".pdf") "xdg-open" (file))
     (,(rx ".mp3") "deadbeef" (file))
     (,(rx (or ".mpeg" ".avi" ".wmv" ".mp4" ".mkv")) "mpv" (file))
     (,(rx (or ".jpg" ".jpeg" ".webp" ".gif")) "imv" (file))))
  :init (openwith-mode t))
#+end_src

** email
#+begin_src elisp
(use-package himalaya
  :elpaca (himalaya
             :type git
             :host github
             :repo "dantecatalfamo/himalaya-emacs")
  :commands himalaya
  :bind ("C-c e l" . himalaya))
#+end_src

** side minimap
#+begin_src elisp
(use-package minimap
  :custom
  (minimap-window-location 'right)
  (minimap-update-delay 0.5))
#+end_src

#+begin_src elisp :tangle ~/config/emacs/themes/battery.el
(minimap-semantic-type-face       (:height 2.75 :box (:line-width 1 :color grey15) :background grey0 :inherit ('font-lock-function-name-face 'minimap-font-face)))
(minimap-semantic-variable-face   (:height 2.75 :box (:line-width 1 :color grey15) :background grey0 :inherit ('font-lock-function-name-face 'minimap-font-face)))
(minimap-semantic-function-face   (:height 2.75 :box (:line-width 1 :color grey15) :background grey0 :inherit ('font-lock-function-name-face 'minimap-font-face)))
(minimap-active-region-background (:extend t :background grey3))
(minimap-current-line-face        (:background grey6))
(minimap-font-face                (:height 20 :inherit 'default))
(minimap-active-region            (:background grey8))
#+end_src

