config/emacs/themes/battery.el
     (compilation-info (:inherit 'success))
     (compilation-mode-line-fail (:weight 'bold :foreground red :inherit 'compilation-error))
     (compilation-mode-line-run (:inherit 'compilation-warning))
     (compilation-mode-line-exit (:weight 'bold :foreground green :inherit 'compilation-info))
     (compilation-line-number (:inherit 'font-lock-keyword-face))
     (compilation-column-number (:inherit 'font-lock-doc-face))

     ;; magit
