config/emacs/themes/battery.el
     (message-header-cc (:weight 'bold :foreground lighter-green))
     (message-header-newsgroups (:weight 'bold :slant 'italic :foreground lighter-olive))
     (message-header-xheader (:foreground neutral9))
     (message-separator (:foreground neutral15))
     (message-cited-text-1 (:foreground lighter-purple))
     (message-cited-text-2 (:foreground green))
     (message-cited-text-3 (:foreground yellow))
     (message-cited-text-4 (:foreground orange))
     (message-mml (:foreground lighter-green))
     (message-signature-separator (:weight 'bold))

     ;; vc
     (vc-state-base nil)
     (vc-up-to-date-state (:inherit 'vc-state-base))
     (vc-needs-update-state (:inherit 'vc-state-base))
     (vc-locked-state (:inherit 'vc-state-base))
     (vc-locally-added-state (:inherit 'vc-state-base))
     (vc-conflict-state (:inherit 'vc-state-base))
     (vc-removed-state (:inherit 'vc-state-base))
     (vc-missing-state (:inherit 'vc-state-base))
     (vc-edited-state (:inherit 'vc-state-base))

     ;; eww
     (eww-form-submit (:box (:line-width 2 :style 'released-button) :foreground bg :background neutral8))
     (eww-form-file (:box (:line-width 2 :style 'released-button) :foreground bg :background neutral8))
     (eww-form-checkbox (:box (:line-width 2 :style 'released-button) :foreground bg :background neutral11))
     (eww-form-select (:box (:line-width 2 :style 'released-button) :foreground bg :background neutral11))
     (eww-form-text (:box (:line-width 1) :foreground neutral15 :background neutral5))
     (eww-form-textarea (:box (:line-width 1) :foreground bg :background neutral11))
     (eww-invalid-certificate (:weight 'bold :foreground red))
     (eww-valid-certificate (:weight 'bold :foreground green))

     ;; rst
     (rst-block (:inherit 'font-lock-keyword-face))
     (rst-external (:inherit 'font-lock-type-face))
     (rst-definition (:inherit 'font-lock-function-name-face))
     (rst-directive (:inherit 'font-lock-builtin-face))
     (rst-comment (:inherit 'font-lock-comment-face))
     (rst-emphasis1 (:inherit 'italic))
     (rst-emphasis2 (:inherit 'bold))
     (rst-literal (:inherit 'font-lock-string-face))
     (rst-reference (:inherit 'font-lock-variable-name-face))
     (rst-transition (:inherit 'font-lock-keyword-face))
     (rst-adornment (:inherit 'font-lock-keyword-face))
     (rst-level-1 (:background neutral2))
     (rst-level-2 (:background neutral3))
     (rst-level-3 (:background neutral5))
     (rst-level-4 (:background neutral6))
     (rst-level-5 (:background neutral7))
     (rst-level-6 (:background neutral8))

     ;; gnus
     (gnus-group-news-1-empty (:foreground lighter-cyan))
     (gnus-group-news-1 (:weight 'bold :inherit 'gnus-group-news-1-empty))
     (gnus-group-news-2-empty (:foreground lighter-cyan))
     (gnus-group-news-2 (:weight 'bold :inherit 'gnus-group-news-2-empty))
     (gnus-group-news-3-empty nil)
     (gnus-group-news-3 (:weight 'bold :inherit 'gnus-group-news-3-empty))
     (gnus-group-news-4-empty nil)
     (gnus-group-news-4 (:weight 'bold :inherit 'gnus-group-news-4-empty))
     (gnus-group-news-5-empty nil)
     (gnus-group-news-5 (:weight 'bold :inherit 'gnus-group-news-5-empty))
     (gnus-group-news-6-empty nil)
     (gnus-group-news-6 (:weight 'bold :inherit 'gnus-group-news-6-empty))
     (gnus-group-news-low-empty (:foreground lighter-cyan))
     (gnus-group-news-low (:weight 'bold :inherit 'gnus-group-news-low-empty))
     (gnus-group-mail-1-empty (:foreground lighter-cyan))
     (gnus-group-mail-1 (:weight 'bold :inherit 'gnus-group-mail-1-empty))
     (gnus-group-mail-2-empty (:foreground lighter-green))
     (gnus-group-mail-2 (:weight 'bold :inherit 'gnus-group-mail-2-empty))
     (gnus-group-mail-3-empty (:foreground lighter-green))
     (gnus-group-mail-3 (:weight 'bold :inherit 'gnus-group-mail-3-empty))
     (gnus-group-mail-low-empty (:foreground lighter-green))
     (gnus-group-mail-low (:weight 'bold :inherit 'gnus-group-mail-low-empty))
     (gnus-summary-selected (:underline t :extend t))
     (gnus-summary-cancelled (:extend t :foreground lighter-olive :background bg))
     (gnus-summary-normal-ticked (:extend t :foreground lighter-purple))
     (gnus-summary-high-ticked (:weight 'bold :inherit 'gnus-summary-normal-ticked))
     (gnus-summary-low-ticked (:slant 'italic :inherit 'gnus-summary-normal-ticked))
     (gnus-summary-normal-ancient (:extend t :foreground neutral11))
     (gnus-summary-high-ancient (:weight 'bold :inherit 'gnus-summary-normal-ancient))
     (gnus-summary-low-ancient (:slant 'italic :inherit 'gnus-summary-normal-ancient))
     (gnus-summary-normal-undownloaded (:weight 'normal :extend t :foreground cyan))
     (gnus-summary-high-undownloaded (:weight 'bold :inherit 'gnus-summary-normal-undownloaded))
     (gnus-summary-low-undownloaded (:slant 'italic :inherit 'gnus-summary-normal-undownloaded))
     (gnus-summary-normal-unread (:extend t))
     (gnus-summary-high-unread (:weight 'bold :inherit 'gnus-summary-normal-unread))
     (gnus-summary-low-unread (:slant 'italic :inherit 'gnus-summary-normal-unread))
     (gnus-summary-normal-read (:extend t :foreground lighter-green))
     (gnus-summary-high-read (:weight 'bold :inherit 'gnus-summary-normal-read))
     (gnus-summary-low-read (:slant 'italic :inherit 'gnus-summary-normal-read))
     (gnus-splash (:foreground neutral11))
     (gnus-emphasis-bold (:weight 'bold))
     (gnus-emphasis-italic (:slant 'italic))
     (gnus-emphasis-underline (:underline t))
     (gnus-emphasis-underline-bold (:weight 'bold :underline t))
     (gnus-emphasis-underline-italic (:slant 'italic :underline t))
     (gnus-emphasis-bold-italic (:weight 'bold :slant 'italic))
     (gnus-emphasis-underline-bold-italic (:weight 'bold :slant 'italic :underline t))
     (gnus-emphasis-strikethru (:strike-through t))
     (gnus-emphasis-highlight-words (:foreground lighter-olive :background bg))
     (gnus-button (:weight 'bold))
     (gnus-signature (:slant 'italic))
     (gnus-header-from (:foreground lighter-green))
     (gnus-header-subject (:foreground lighter-green))
     (gnus-header-newsgroups (:slant 'italic :foreground lighter-olive))
     (gnus-header-name (:foreground lighter-green))
     (gnus-header-content (:slant 'italic :foreground lighter-green))

     (line-number-major-tick (:weight 'bold :background neutral11))
     (line-number-minor-tick (:weight 'bold :background neutral8))

     (fill-column-indicator (:weight 'normal :slant 'normal :underline nil :overline nil :strike-through nil :box nil :inverse-video nil :stipple nil :inherit 'shadow))

     (nobreak-space (:underline t :inherit 'escape-glyph))
     (nobreak-hyphen (:foreground lighter-cyan))

     (mode-line-highlight (:box (:line-width 2 :color neutral6 :style 'released-button)))
     (mode-line-emphasis (:weight 'bold))
     (mode-line-buffer-id (:weight 'bold))

     (csv-separator-face (:foreground high-cyan))

     ;; tty-menu
     (tty-menu-enabled-face (:weight 'bold :foreground lighter-olive :background neutral4))
     (tty-menu-disabled-face (:foreground neutral11 :background neutral4))
     (tty-menu-selected-face (:background red))

     ;; show-paren
     (show-paren-match-expression (:inherit 'show-paren-match))
     (show-paren-mismatch (:foreground bg :background high-purple))
     (show-paren-match    (:background low-cyan))

     ;; completions
     (completions-group-title (:slant 'italic :inherit 'shadow))
     (completions-group-separator (:strike-through t :inherit 'shadow))
     (completions-annotations (:inherit ('italic 'shadow)))
     (completions-first-difference (:inherit 'bold))
     (completions-common-part (:foreground neutral15))

     ;; tab-bar
     (tab-bar-tab (:box (:line-width 1 :style 'released-button) :inherit 'tab-bar))
     (tab-bar-tab-inactive (:background neutral11 :inherit 'tab-bar-tab))
     (tab-bar-tab-group-current (:weight 'bold :box nil :inherit 'tab-bar-tab))
     (tab-bar-tab-group-inactive (:inherit ('shadow 'tab-bar-tab-inactive)))
     (tab-bar-tab-ungrouped (:inherit ('shadow 'tab-bar-tab-inactive)))
     (tab-bar (:foreground bg :background neutral15 :inherit 'variable-pitch))

     ;; calendar
     (calendar-today (:underline t))
     (calendar-weekday-header (:inherit 'font-lock-constant-face))
     (calendar-weekend-header (:inherit 'font-lock-comment-face))
     (calendar-month-header (:inherit 'font-lock-function-name-face))

     ;; yas
     (yas-field-highlight-face (:inherit 'region))
     (yas--field-debug-face nil)

     ;; hl-todo
     (hl-todo (:weight 'bold :foreground light-purple))

     ;; xref
     (xref-file-header (:inherit 'compilation-info))
     (xref-line-number (:inherit 'compilation-line-number))
     (xref-match (:inherit 'match))

     ;; outline
     (outline-1 (:inherit 'font-lock-function-name-face))
     (outline-2 (:inherit 'font-lock-variable-name-face))
     (outline-3 (:inherit 'font-lock-keyword-face))
     (outline-4 (:inherit 'font-lock-comment-face))
     (outline-5 (:inherit 'font-lock-type-face))
     (outline-6 (:inherit 'font-lock-constant-face))
     (outline-7 (:inherit 'font-lock-builtin-face))
     (outline-8 (:inherit 'font-lock-string-face))

     ;; widget
     (widget-documentation (:foreground light-green))
     (widget-button (:weight 'bold))
     (widget-field (:extend t :background grey3))
     (widget-single-line-field (:background neutral6))
     (widget-inactive (:inherit 'shadow))
     (widget-button-pressed (:foreground red))

     ;; epa
     (epa-validity-high (:weight 'bold :foreground lighter-cyan))
     (epa-validity-medium (:slant 'italic :foreground lighter-cyan))
     (epa-validity-low (:slant 'italic))
     (epa-validity-disabled (:slant 'italic :inverse-video t))
     (epa-string (:foreground neutral15))
     (epa-mark (:weight 'bold :foreground yellow))
     (epa-field-name (:weight 'bold :foreground lighter-cyan))
     (epa-field-body (:slant 'italic :foreground lighter-cyan))

     ;; shr
     (shr-strike-through (:strike-through t))
     (shr-link (:inherit 'link))
     (shr-selected-link (:background red :inherit 'shr-link))
     (shr-abbreviation (:underline (:style 'wave) :inherit 'underline))
     (shr-h1 (:height 1.3 :weight 'bold))
     (shr-h2 (:weight 'bold))
     (shr-h3 (:slant 'italic))
     (shr-h4 nil)
     (shr-h5 nil)
     (shr-h6 nil)

     ;; speedbar
     (speedbar-button-face (:foreground light-green))
     (speedbar-file-face (:foreground lighter-cyan))
     (speedbar-directory-face (:foreground neutral15))
     (speedbar-tag-face (:foreground lighter-olive))
     (speedbar-selected-face (:underline t :foreground red))
     (speedbar-highlight-face (:background cyan))
     (speedbar-separator-face (:overline neutral10 :foreground neutral15 :background neutral4))

     ;; shortdoc
     (shortdoc-heading (:height 1.3 :weight 'bold :inherit 'variable-pitch))
     (shortdoc-section (:inherit 'variable-pitch))

     ;; window-divider
     (window-divider-first-pixel (:foreground neutral11))
     (window-divider-last-pixel (:foreground neutral6))

     ;; fonts
     (fixed-pitch (:family "SauceCodePro Nerd Font Mono" :height 100 :inherit 'default))
     (fixed-pitch-serif (:family "Monospace Serif"))
     (variable-pitch (:family "NotoSans Display Nerd Font" :height 105))

     ;; nushell
     (nushell-pay-attention-face (:inherit 'font-lock-builtin-face))

     ;; focus
     (focus-unfocused (:inherit 'shadow))
     (focus-focused nil)

     ;; term
     (term (:inherit 'default))
     (term-bold (:inherit 'ansi-color-bold))
     (term-underline (:inherit 'ansi-color-underline))

     (term-color-black   (:inherit 'ansi-color-black))
     (term-color-red     (:inherit 'ansi-color-red))
     (term-color-green   (:inherit 'ansi-color-green))
     (term-color-yellow  (:inherit 'ansi-color-yellow))
     (term-color-blue    (:inherit 'ansi-color-blue))
     (term-color-magenta (:inherit 'ansi-color-magenta))
     (term-color-cyan    (:inherit 'ansi-color-cyan))
     (term-color-white   (:inherit 'ansi-color-white))

     (term-color-bright-black   (:inherit 'ansi-color-bright-black))
     (term-color-bright-red     (:inherit 'ansi-color-bright-red))
     (term-color-bright-green   (:inherit 'ansi-color-bright-green))
     (term-color-bright-yellow  (:inherit 'ansi-color-bright-yellow))
     (term-color-bright-blue    (:inherit 'ansi-color-bright-blue))
     (term-color-bright-magenta (:inherit 'ansi-color-bright-magenta))
     (term-color-bright-cyan    (:inherit 'ansi-color-bright-cyan))
     (term-color-bright-white   (:inherit 'ansi-color-bright-white))

     ;; apropos
     (apropos-symbol (:inherit 'bold))
     (apropos-keybinding (:inherit 'underline))
     (apropos-property (:inherit 'font-lock-builtin-face))
     (apropos-button (:inherit ('font-lock-variable-name-face 'button)))
     (apropos-function-button (:inherit ('font-lock-function-name-face 'button)))
     (apropos-variable-button (:inherit ('font-lock-variable-name-face 'button)))
     (apropos-user-option-button (:inherit ('font-lock-variable-name-face 'button)))
     (apropos-misc-button (:inherit ('font-lock-constant-face 'button)))

     ;; sly
     (sly-action-face (:inherit 'warning))
     (sly-part-button-face (:inherit 'font-lock-constant-face))
     (sly-error-face (:underline light-red))
     (sly-warning-face (:underline (:color high-orange)))
     (sly-style-warning-face (:underline lighter-yellow))
     (sly-note-face (:underline lighter-yellow))
     (sly-db-topline-face nil)
     (sly-db-condition-face (:inherit 'error))
     (sly-db-section-face (:inherit 'header-line))
     (sly-db-frame-label-face (:inherit 'shadow))
     (sly-db-restart-face nil)
     (sly-db-restart-number-face (:inherit 'shadow))
     (sly-db-frame-line-face nil)
     (sly-db-restartable-frame-line-face (:inherit 'font-lock-constant-face))
     (sly-db-non-restartable-frame-line-face nil)
     (sly-db-local-name-face nil)
     (sly-db-catch-tag-face nil)
     (sly-mode-line (:weight 'bold :inherit 'font-lock-constant-face))
     (sly-apropos-symbol (:inherit 'sly-part-button-face))
     (sly-apropos-label (:inherit 'italic))
     (sly-mrepl-prompt-face (:inherit 'font-lock-builtin-face))
     (sly-mrepl-note-face (:inherit 'font-lock-keyword-face))
     (sly-mrepl-output-face (:foreground fg))
     (sly-reader-conditional-face (:inherit 'font-lock-comment-face))
     (sly-stickers-placed-face (:foreground bg :background neutral11))
     (sly-stickers-armed-face (:strike-through nil :inherit 'hi-blue))
     (sly-stickers-recordings-face (:strike-through nil :inherit 'hi-green))
     (sly-stickers-empty-face (:strike-through nil :inherit 'hi-pink))
     (sly-stickers-exited-non-locally-face (:strike-through t :inherit 'sly-stickers-empty-face))

     ;; info
     (info-node (:weight 'bold :slant 'italic :foreground neutral15))
     (info-title-1 (:height 1.2 :inherit 'info-title-2))
     (info-title-2 (:height 1.2 :inherit 'info-title-3))
     (info-title-3 (:height 1.2 :inherit 'info-title-4))
     (info-title-4 (:weight 'bold :inherit 'variable-pitch))
     (info-menu-header (:weight 'bold :inherit 'variable-pitch))
     (info-menu-star (:foreground red))
     (info-xref (:inherit 'link))
     (info-xref-visited (:inherit ('link-visited 'info-xref)))
     (info-header-xref (:inherit 'info-xref))
     (info-header-node (:inherit 'info-node))
     (info-index-match (:inherit 'match))

     ;; ess
     (ess-watch-current-block-face (:inherit 'highlight))
     (ess-bp-fringe-recover-face (:foreground dark-purple))
     (ess-bp-fringe-browser-face (:foreground neutral3))
     (ess-bp-fringe-logger-face (:foreground darker-red))
     (ess-bp-fringe-inactive-face (:foreground neutral6))
     (ess-debug-blink-same-ref-face (:background neutral7))
     (ess-debug-blink-ref-not-found-face (:background dark-purple))
     (ess-debug-current-debug-line-face (:inherit 'highlight))
     (ess-tracebug-last-input-fringe-face (:overline neutral3 :foreground neutral3))
     (ess-r-control-flow-keyword-face (:inherit 'ess-keyword-face))
     (ess-keyword-face (:inherit 'font-lock-keyword-face))
     (ess-matrix-face (:inherit 'font-lock-constant-face))
     (ess-constant-face (:inherit 'font-lock-type-face))
     (ess-modifiers-face (:inherit 'font-lock-constant-face))
     (ess-paren-face (:inherit 'font-lock-constant-face))
     (ess-assignment-face (:inherit 'font-lock-constant-face))
     (ess-%op%-face (:inherit 'ess-operator-face))
     (ess-operator-face (:inherit 'font-lock-constant-face))
     (ess-numbers-face (:slant 'normal :inherit 'font-lock-type-face))
     (ess-function-call-face (:slant 'normal :inherit 'font-lock-function-name-face))

     ;; rest
     (buffer-menu-buffer (:weight 'bold))
     (border nil)
     (browse-url-button (:inherit 'link))
     (c-annotation-face (:inherit 'font-lock-constant-face))
     (child-frame-border nil)
     (comint-highlight-input (:weight 'bold))
     (comint-highlight-prompt (:inherit 'minibuffer-prompt))
     (edebug-enabled-breakpoint (:inherit 'highlight))
     (edebug-disabled-breakpoint (:extend t :background dark-cyan))
     (elisp-shorthand-font-lock-face (:foreground lighter-cyan :inherit 'font-lock-keyword-face))
     (escape-glyph        (:foreground higher-purple))
     (eldoc-highlight-function-argument (:inherit 'bold))
     (file-name-shadow (:inherit 'shadow))
     (glyphless-char (:height 0.6))
     (holiday (:background dark-orange))
     (helpful-heading (:weight 'bold))
     (help-key-binding    (:foreground high-orange :background grey4 :box (:line-width 1 :color grey6)))
     (header-line-highlight (:inherit 'mode-line-highlight))
     (help-argument-name (:inherit 'italic))
     (help-for-help-header (:height 1.26))
     (Info-quoted (:inherit 'fixed-pitch-serif))
     (mm-command-output (:foreground green))
     (mm-uu-extract (:extend t :foreground neutral15 :background dark-green))
     (minimap-active-region (:background grey10))
     (mouse nil)
     (mouse-drag-and-drop-region (:inherit 'region))
     (menu nil)
     (next-error (:inherit 'region))
     (next-error-message (:extend t :inherit 'highlight))
     (olivetti-fringe (:inherit 'fringe))
     (read-multiple-choice-face (:weight 'bold :inherit 'underline))
     (rmail-highlight (:inherit 'highlight))
     (rmail-header-name (:inherit 'font-lock-function-name-face))
     (scroll-bar nil)
     (separator-line (:height 0.1 :background neutral5))
     (tab-line (:height 0.9 :foreground bg :background neutral15 :inherit 'variable-pitch))
     (tool-bar (:box (:line-width 1 :style 'released-button) :foreground bg :background neutral11))
     (tabulated-list-fake-header (:weight 'bold :underline t :overline t))
     (tooltip (:foreground bg :background neutral15 :inherit 'variable-pitch))
     )

    (custom-theme-set-variables
       (quote ,name)
       `(ansi-color-names-vector
         [,red
          ,olive
          ,orange
          ,purple
          ,yellow
          ,green
          ,cyan]))))

(provide 'battery)
